## Dataset

영국의 제1형 당뇨병을 가진 젊은 성인을 대상으로 데이터 수집

- **수집 장비**: 연속혈당측정기(CGM), 인슐린펌프, 스마트워치를 이용하여 혈당 수치, 인슐린 용량, 탄수화물 섭취량, 활동 데이터를 수집함.
- **데이터 수집 주기**: 5분 간격으로 각 시점별 데이터를 수집하며, 각 행은 `time` 기준으로 6시간 전을 시작점으로 하고, 5분 간격으로 집계된 데이터를 포함.
- **기기 차이**: 데이터 수집에 사용된 기기들이 동일 모델이 아니어서, 데이터 간 차이가 있을 수 있음.
- **데이터 결측 및 노이즈**: 데이터 내에 missing value와 noise가 존재.

### 예측 목표

각 샘플에 대해 **한 시간 후의 혈당 수치 예측**이 목적임.

### 데이터 구성

- **학습 데이터**
    - 연구 초기 3개월 동안 9명의 데이터 수집. 미래 혈당 값이 포함됨.
    - 시간 순서대로 배열되어 있음.

- **테스트 데이터**
    - 연구 기간 중 나머지 15명의 새로운 참가자 데이터로, 학습 데이터와 겹치지 않음.
    - 무작위 순서로 배열됨.

---

## Columns 설명

- **id**: 환자 번호 및 카운트
- **p_num**: 환자 일련번호
- **bg-X:XX**: time 값 기준 X:XX 전 시점에서의 혈당(blood glucose) 수치 (단위: mmol/L), CGM으로 측정됨.

아래 지표들은 모두 `time` 기준 X:XX+5 ~ X:XX 전의 5분 동안의 변화량에 대한 데이터임.

- **insuline-X:XX**: 5분 동안 투여된 전체 인슐린 양, 인슐린 펌프로 측정됨.
- **carbs-X:XX**: 5분 동안 섭취한 총 탄수화물의 양, 환자가 기록함.
- **hr-X:XX**: 5분 동안의 평균 심박수 (단위: BPM), 스마트워치로 측정됨.
- **steps-X:XX**: 5분 동안의 총 걸음 수, 스마트워치로 측정됨.
- **cals-X:XX**: 5분 동안 소모한 총 칼로리, 스마트워치로 측정됨.
- **activity-X:XX**: 5분 동안 행한 활동이 기록되어 있음. 활동 항목은 `activity.txt`에 저장되어 있음.

- **bg+1:00**: 1시간 후의 혈당 수치. 예측 대상 지표.
